# Pandas

## Dataframe

In [5]:
import pandas as pd
data = {
    "NAME": ["Amrit", "Darpan", "Kripesh"],
    "AGE": [18, 19, 20],
    "GENDER": [0, 0, 0]
}
df = pd.DataFrame(data, columns=["NAME", "AGE"])
df

      NAME  AGE
0    Amrit   18
1   Darpan   19
2  Kripesh   20

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    3 non-null      object
 1   AGE     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

Here, object means string.

In [7]:
df.describe()

        AGE
count   3.0
mean   19.0
std     1.0
min    18.0
25%    18.5
50%    19.0
75%    19.5
max    20.0

## From a NumPy array

In [8]:
N = 5000

In [10]:
import numpy as np
df = pd.DataFrame(np.random.rand(N, 5))

In [11]:
df

             0         1         2         3         4
0     0.054021  0.205225  0.719564  0.578913  0.966764
1     0.483493  0.528861  0.154026  0.919426  0.656373
2     0.456265  0.327519  0.581987  0.197372  0.931163
3     0.617892  0.947110  0.467059  0.062695  0.390668
4     0.499514  0.412906  0.325778  0.602552  0.412478
...        ...       ...       ...       ...       ...
4995  0.420568  0.320754  0.096297  0.036167  0.335575
4996  0.176055  0.715593  0.641227  0.231352  0.810731
4997  0.007113  0.916456  0.686269  0.569148  0.278242
4998  0.190724  0.364240  0.829746  0.772112  0.247398
4999  0.652126  0.936839  0.360526  0.904140  0.848259

[5000 rows x 5 columns]

In [13]:
pd.DataFrame(np.random.rand(N, 5), columns = ["a", "b", "c", "d", "e"])

             a         b         c         d         e
0     0.043359  0.589128  0.031608  0.313703  0.781522
1     0.689658  0.369137  0.988929  0.583541  0.549969
2     0.892888  0.830312  0.638718  0.175761  0.177748
3     0.635084  0.860471  0.641405  0.258550  0.614929
4     0.677189  0.644799  0.939061  0.682442  0.166755
...        ...       ...       ...       ...       ...
4995  0.099082  0.640711  0.705686  0.244106  0.519141
4996  0.753754  0.840216  0.141305  0.966849  0.377341
4997  0.328618  0.435282  0.812903  0.831092  0.718712
4998  0.729009  0.320837  0.920623  0.192430  0.336664
4999  0.856792  0.139912  0.826683  0.164634  0.443285

[5000 rows x 5 columns]

In [14]:
df.shape

(5000, 5)

In [15]:
df.size

25000

In [16]:
df.ndim

2

In [17]:
df.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=5000, step=1)

In [19]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5000 non-null   float64
 1   b       5000 non-null   float64
 2   c       5000 non-null   float64
 3   d       5000 non-null   float64
 4   e       5000 non-null   float64
dtypes: float64(5)
memory usage: 195.4 KB

In [23]:
df.describe()

                 a            b            c            d            e
count  5000.000000  5000.000000  5000.000000  5000.000000  5000.000000
mean      0.495104     0.500546     0.502151     0.496343     0.495878
std       0.289440     0.289668     0.290667     0.286977     0.293512
min       0.000063     0.000073     0.000044     0.000052     0.000083
25%       0.238331     0.252351     0.246659     0.240847     0.238557
50%       0.494717     0.499396     0.502080     0.497099     0.494568
75%       0.743016     0.757090     0.758097     0.747696     0.754940
max       0.999820     0.999861     0.999409     0.999974     0.999994

columnwise maximum

In [24]:
df.max()

a    0.999820
b    0.999861
c    0.999409
d    0.999974
e    0.999994
dtype: float64

In [27]:
df.max(axis=1)

0       0.755513
1       0.887167
2       0.912519
3       0.904802
4       0.828889
          ...
4995    0.617945
4996    0.976039
4997    0.993086
4998    0.950581
4999    0.941433
Length: 5000, dtype: float64

In [28]:
df.head()

          a         b         c         d         e
0  0.250223  0.542466  0.096244  0.755513  0.743286
1  0.195730  0.750498  0.808275  0.233030  0.887167
2  0.629410  0.113555  0.912519  0.005507  0.184854
3  0.132205  0.330132  0.845909  0.904802  0.056963
4  0.817243  0.087630  0.828889  0.124962  0.092525

In [29]:
df.head(1)

          a         b         c         d         e
0  0.250223  0.542466  0.096244  0.755513  0.743286

In [30]:
df.tail(3)

             a         b         c         d         e
4997  0.079353  0.150034  0.344651  0.966917  0.993086
4998  0.621560  0.950581  0.767788  0.863710  0.665487
4999  0.304947  0.627881  0.914302  0.433591  0.941433

In [31]:
df.sample()

            a         b        c         d        e
913  0.466147  0.296661  0.04004  0.331792  0.63382

In [32]:
df.sample(10)

             a         b         c         d         e
3656  0.786833  0.249470  0.899298  0.249307  0.850564
1919  0.566162  0.077254  0.156042  0.208476  0.599210
4920  0.890200  0.336384  0.361273  0.592127  0.361223
4486  0.947694  0.565534  0.293202  0.457282  0.442753
220   0.979405  0.765092  0.048873  0.854370  0.211196
2638  0.055202  0.565186  0.218447  0.074652  0.875209
2647  0.426615  0.241299  0.379908  0.584510  0.776957
356   0.555424  0.061823  0.185030  0.387424  0.322481
45    0.384626  0.003861  0.883438  0.235578  0.353236
2438  0.292608  0.806295  0.030762  0.373531  0.822456

**Note: We use pandas for EDA**

## Getting single column

In [34]:
df.a

0       0.250223
1       0.195730
2       0.629410
3       0.132205
4       0.817243
          ...
4995    0.617945
4996    0.324422
4997    0.079353
4998    0.621560
4999    0.304947
Name: a, Length: 5000, dtype: float64

In [35]:
type(df.a)

pandas.core.series.Series

**Series is a 1 dimensional vector**

In [37]:
df.min()

a    0.000063
b    0.000073
c    0.000044
d    0.000052
e    0.000083
dtype: float64

In [38]:
df["a"]

0       0.250223
1       0.195730
2       0.629410
3       0.132205
4       0.817243
          ...
4995    0.617945
4996    0.324422
4997    0.079353
4998    0.621560
4999    0.304947
Name: a, Length: 5000, dtype: float64

**What if we want to get the column "min", which is also a method min()?**

Hence, we can use indexing like in array ["min"]

## Series data to DataFrame

In [39]:
df[["a"]]

             a
0     0.250223
1     0.195730
2     0.629410
3     0.132205
4     0.817243
...        ...
4995  0.617945
4996  0.324422
4997  0.079353
4998  0.621560
4999  0.304947

[5000 rows x 1 columns]

In [40]:
type(df[["a"]])

pandas.core.frame.DataFrame

OR, we can use the to_frame() method aswell

In [42]:
df["a"].to_frame()

             a
0     0.250223
1     0.195730
2     0.629410
3     0.132205
4     0.817243
...        ...
4995  0.617945
4996  0.324422
4997  0.079353
4998  0.621560
4999  0.304947

[5000 rows x 1 columns]

In [43]:
df["a"].values

array([0.25022344, 0.19573036, 0.62940986, ..., 0.0793532 , 0.62155956,
       0.30494718])

In [44]:
df[["a"]].values

array([[0.25022344],
       [0.19573036],
       [0.62940986],
       ...,
       [0.0793532 ],
       [0.62155956],
       [0.30494718]])

In [46]:
df[["a", "b"]]

             a         b
0     0.250223  0.542466
1     0.195730  0.750498
2     0.629410  0.113555
3     0.132205  0.330132
4     0.817243  0.087630
...        ...       ...
4995  0.617945  0.081107
4996  0.324422  0.898911
4997  0.079353  0.150034
4998  0.621560  0.950581
4999  0.304947  0.627881

[5000 rows x 2 columns]

**DataFrame object is immutable, hence need to assign when operated, as required**

In [49]:
df.rename(columns={"a": "A"})

             A         b         c         d         e
0     0.250223  0.542466  0.096244  0.755513  0.743286
1     0.195730  0.750498  0.808275  0.233030  0.887167
2     0.629410  0.113555  0.912519  0.005507  0.184854
3     0.132205  0.330132  0.845909  0.904802  0.056963
4     0.817243  0.087630  0.828889  0.124962  0.092525
...        ...       ...       ...       ...       ...
4995  0.617945  0.081107  0.312470  0.590721  0.570095
4996  0.324422  0.898911  0.414165  0.976039  0.756566
4997  0.079353  0.150034  0.344651  0.966917  0.993086
4998  0.621560  0.950581  0.767788  0.863710  0.665487
4999  0.304947  0.627881  0.914302  0.433591  0.941433

[5000 rows x 5 columns]

**We can use inplace parameter to every df operation, to replace the df within the operation.
<br>
Caution: It doesn't return anything though**

In [51]:
df2 = df.rename(columns={"a": "A"}, inplace=True)
df2 # None is returned

In [52]:
df.columns

Index(['A', 'b', 'c', 'd', 'e'], dtype='object')

# Exercise
Create a dataframe using

- dictionary
- numpy array
- set column name to the dataframe
- using csv file (data_studentlist.csv)(use header parameter)

DataFrame Attribudes

- shape, size, ndim, columns, index, type, info, describe, head, tail, sample
- replace column of dataframe
- index column of dataframe using . operator
- index column of dataframe using [] operator

## Using Dict

In [57]:
from datetime import datetime
posts = {
    "caption": ["Handsome xu ni ma?", "Hello, World!", "Kr** ko **"],
    "user_name": ["amrit", "darpan", "kripesh"],
    "datetime": [datetime.now(), datetime.now(), datetime.now()]
}
posts

{'caption': ['Handsome xu ni ma?', 'Hello, World!', 'Kr** ko **'],
 'user_name': ['amrit', 'darpan', 'kripesh'],
 'datetime': [datetime.datetime(2024, 6, 9, 15, 9, 29, 46725),
  datetime.datetime(2024, 6, 9, 15, 9, 29, 46725),
  datetime.datetime(2024, 6, 9, 15, 9, 29, 46725)]}

In [58]:
posts_df = pd.DataFrame(posts)

In [59]:
posts_df

              caption user_name                   datetime
0  Handsome xu ni ma?     amrit 2024-06-09 15:09:29.046725
1       Hello, World!    darpan 2024-06-09 15:09:29.046725
2          Kr** ko **   kripesh 2024-06-09 15:09:29.046725

## Using NumPy Array

In [64]:
posts = np.array(
    [
        ["Handsome xu ni ma?", "amrit", datetime.now()],
        ["Hello, World!", "darpan", datetime.now()],
        ["Kr** ko **", "kripesh", datetime.now()]
    ]
)

In [65]:
posts

array([['Handsome xu ni ma?', 'amrit',
        datetime.datetime(2024, 6, 9, 15, 15, 11, 208895)],
       ['Hello, World!', 'darpan',
        datetime.datetime(2024, 6, 9, 15, 15, 11, 208895)],
       ['Kr** ko **', 'kripesh',
        datetime.datetime(2024, 6, 9, 15, 15, 11, 208895)]], dtype=object)

In [71]:
df = pd.DataFrame(posts)
df

                    0        1                          2
0  Handsome xu ni ma?    amrit 2024-06-09 15:15:11.208895
1       Hello, World!   darpan 2024-06-09 15:15:11.208895
2          Kr** ko **  kripesh 2024-06-09 15:15:11.208895

In [75]:
df = pd.DataFrame(posts, columns=["caption", "user_name", "datetime"])
df

              caption user_name                   datetime
0  Handsome xu ni ma?     amrit 2024-06-09 15:15:11.208895
1       Hello, World!    darpan 2024-06-09 15:15:11.208895
2          Kr** ko **   kripesh 2024-06-09 15:15:11.208895

In [76]:
df.rename(columns={"user_name": "first_name"})

              caption first_name                   datetime
0  Handsome xu ni ma?      amrit 2024-06-09 15:15:11.208895
1       Hello, World!     darpan 2024-06-09 15:15:11.208895
2          Kr** ko **    kripesh 2024-06-09 15:15:11.208895

## Read from .csv file

In [78]:
pd.read_csv("../csv-files/std-iq.csv")

    Student_ID  CGPA   IQ  Placement
0            1   6.8  123          1
1            2   5.9  106          0
2            3   5.3  121          0
3            4   7.4  132          1
4            5   5.8  142          0
..         ...   ...  ...        ...
95          96   4.3  200          0
96          97   4.4   42          0
97          98   6.7  182          1
98          99   6.3  103          1
99         100   6.2  113          1

[100 rows x 4 columns]

## Others

### loc and iloc for filtering

In [85]:
df.loc[:, "user_name"]

0      amrit
1     darpan
2    kripesh
Name: user_name, dtype: object

#### loc{row, column} slicing

#### iloc is same, but column ko value chai int ma dinu paro

**loc le chai int lai ni label ko roop ma treat garo, bhane iloc le chai int lai index ko roop ma treat garo**